# [(-)i]和[[(-)i]]结果总结
library(tidyverse)

index_comparison <- data.frame(
  对象类型=c("向量","一维数组","矩阵/二维数组","三维数组","列表","数据框"),
  
  # 一、选出相应数据
  # （一）各维度只选出一个维数
  # （1）选出一个维度
  "[i]"=c(rep("数据",4),"单行列表","单列数据框（=[,j,drop = FALSE）"),
  "[[i]]"=c(rep("数据",4),"数据/对象","向量（=[,j]）"),
  
  # （2）选出两个维度
  "[i,j]"=c(rep("-",2),"数据",rep("-",2),"数据"),
  "[[i,j]]"=c(rep("-",2),"数据",rep("-",2),"数据"),
  # 以上两者效果等同
  
  "[i,]"=c(rep("-",2),"向量",rep("-",2),"单行数据框"), 
  "[i,,drop = FALSE]"=c(rep("-",2),"单行矩阵",rep("-",2),"单行数据框"), 
  
  "[,j]"=c(rep("-",2),"向量",rep("-",2),"向量（=[[i]]）"),
  "[,j,drop = FALSE]"=c(rep("-",2),"单列矩阵",rep("-",2),"单列数据框（=[i]）"),
  
  # （3）选出三个维度
  "[i,j,k]"=c(rep("-",3),"数据",rep("-",2)),
  "[[i,j,k]]"=c(rep("-",3),"数据",rep("-",2)),
  # 以上两者效果等同
  
  "[i,,k]"=c(rep("-",3),"向量",rep("-",2)),
  "[i,,k,drop = FALSE]"=c(rep("-",3),"矩阵",rep("-",2)),
  
  "[i,,]"=c(rep("-",3),"矩阵",rep("-",2)),
  "[i,,,drop = FALSE]"=c(rep("-",3),"三维数组",rep("-",2)),
  
  # （二）各维度选出多个维数
  # （1）选出一个维度
  "[c(i,j,……)]"=c(rep("向量",4),"多行列表","多列数据框（=[,c(i2,j2,……)]）"),

  # （2）选出两个维度
  "[c(i1,j1,……),c(i2,j2,……)]"=c(rep("-",2),"矩阵",rep("-",2),"多行多列数据框"),
  
  "[c(i1,j1,……),]"=c(rep("-",2),"矩阵",rep("-",2),"多行数据框"),
  "[,c(i2,j2,……)]"=c(rep("-",2),"矩阵",rep("-",2),"多列数据框（=[c(i,j,……)]）"),

  # （3）选出三个维度
  "[c(i1,j1,……),c(i2,j2,……),c(i3,j3,……)]"=c(rep("-",3),"三维数组",rep("-",2)),
  
  # [[]]无意义的情况一
  "[[i,]]"=c(rep("-",6)),
  "[[,j]]"=c(rep("-",6)),
  #[[i,,k,(drop = FALSE)]]、[[i,,(drop = FALSE)]]的情况与此类似，以下不再讨论
  
  # [[]]无意义的情况二
  "[[c(i,j,……)]]"=c(rep("-",6)),
  # [[c(i1,j1,……),c(i2,j2,……)]]的情况与此类似，以下不再讨论
  # [c(i1,j1,……),c(i2,j2,……),c(i3,j3,……)]]的情况与此类似，以下不再讨论
  
  # [[c(i1,j1,……),]]、[[,c(i2,j2,……)]]的情况与此类似，以下不再讨论
  # [[c(i1,j1,……),,c(i3,j3,……)]]、[[c(i1,j1,……),,]]的情况与此类似，以下不再讨论
  
  # [[]]无意义的情况三
  "[[-i]]"=c(rep("-",6)),
  
  # 二、删除相应数据
  # （一）各维度只删除一个维数
  # （1）删除一个维度
  "[-i]"=c(rep("向量",4),"列表","数据框"),
  
  # （2）删除两个维度
  "[(-)i,(-)j]"=c(rep("-",2),"数据/向量/矩阵",rep("-",2),"数据/向量/数据框"),
  "[(-)i,(-)j,drop = FALSE]"=c(rep("-",2),"矩阵",rep("-",2),"数据框"),
  
  # （3）删除一个维度，选出一个维度
  # "[-i,j]/[-i,]"情况同上
  # "[-i,j,drop = FALSE]/[-i,,drop = FALSE]"情况同上
  
  # （4）删除三个维度
  # "[-i,-j,-k]"情况同上
  # "[-i,-j,-k,drop = FALSE]情况同上
  
  # （5）删除一个维度，选出两个维度
  # "[-i,j,k]"
  # "[-i,,k]"
  # "[-i,,]"
  # 同上，略
  
  # （6）删除两个维度，选出一个维度
  # "[-i,j,-k]"
  # "[-i,,-k]"
  # 同上，略
  
  # （二）各维度删除多个维数
  # （1）删除一个维度
  "[-c(i,j,……)]"=c(rep("向量",4),"列表","数据框"),
  
  # （2）删除两个维度
  "[(-)c(i1,j1,……),(-)c(i2,j2,……)]"=c(rep("-",2),"数据/向量/矩阵",rep("-",2),"数据/向量/数据框"),
  "[(-)c(i1,j1,……),(-)c(i2,j2,……),drop = FALSE]"=c(rep("-",2),"矩阵",rep("-",2),"数据框"),
  
  # （3）删除一个维度，选出一个维度
  # 略
  
  # （3）删除三个维度
  # "[-c(i1,j1,……),-c(i2,j2,……),-c(i3,j3,……)]"情况同上
  # "[-c(i1,j1,……),-c(i2,j2,……),,-c(i3,j3,……),drop = FALSE]"情况同上
  
  # （4）删除一个维度，选出两个维度
  # 略
  
  # （5）删除两个维度，选出一个维度
  # 略
    check.names = FALSE
) %>% 
  column_to_rownames("对象类型") %>% 
  t() 

write.csv(index_comparison,"索引结果总结.csv",fileEncoding = "GB2312")



